glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KLxx_DFP.pdsc
        <!-- ******************************  MKL04Z16xxx4  ****************************** -->
        <device Dname="MKL04Z16xxx4">
          <compile header="Device/Include/MKL04Z4.h" define="MKL04Z16xxx4"/>
          <debug svd="SVD/MKL04Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P16_48MHZ.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

          <book name="Documents/KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents/KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z32xxx4  ****************************** -->
        <device Dname="MKL04Z32xxx4">
          <compile header="Device/Include/MKL04Z4.h" define="MKL04Z32xxx4"/>
          <debug svd="SVD/MKL04Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents/KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z8xxx4  ****************************** -->
        <device Dname="MKL05Z8xxx4">
          <compile header="Device/Include/MKL05Z4.h" define="MKL05Z8xxx4"/>
          <debug svd="SVD/MKL05Z4.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFFF00" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P8_48MHZ.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFF00" RAMsize="0x00000400" default="1"/>

          <book name="Documents/KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents/KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z16xxx4  ****************************** -->
        <device Dname="MKL05Z16xxx4">
          <compile header="Device/Include/MKL05Z4.h" define="MKL05Z16xxx4"/>
          <debug svd="SVD/MKL05Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P16_48MHZ.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

          <book name="Documents/KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents/KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z32xxx4  ****************************** -->
        <device Dname="MKL05Z32xxx4">
          <compile header="Device/Include/MKL05Z4.h" define="MKL05Z32xxx4"/>
          <debug svd="SVD/MKL05Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents/KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL1x    ****************************** -->
      <subFamily DsubFamily="KL1x">
        <description>
The Kinetis KL1x is a general purpose ultra-low-power MCU family, providing additional memory, communications and analog peripheral options beyond those offered in the Kinetis KL0x MCU family.
The KL1x MCU family is compatible with Kinetis K10 MCUs (based on ARM® Cortex®-M4) and with all other Kinetis KL1x, KL2x, KL3x and KL4x series MCUs, providing a migration path to higher performance and feature integration.
        </description>

        <!-- ******************************  MKL14Z32xxx4  ****************************** -->
        <device Dname="MKL14Z32xxx4">
          <compile header="Device/Include/MKL14Z4.h" define="MKL14Z32xxx4"/>
          <debug svd="SVD/MKL14Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL14P80M48SF0RM.pdf" title="KL14 Sub-Family Reference Manual"/>
          <book name="Documents/KL14P80M48SF0.pdf"   title="KL14 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL14Z64xxx4  ****************************** -->
        <device Dname="MKL14Z64xxx4">
          <compile header="Device/Include/MKL14Z4.h" define="MKL14Z64xxx4"/>
          <debug svd="SVD/MKL14Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

