glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KLxx_DFP.pdsc
    <condition id="MKL05Z4 CMSIS">
      <description>NXP Kinetis KL05 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL05Z16xxx4"/>
      <accept Dname="MKL05Z32xxx4"/>
      <accept Dname="MKL05Z8xxx4"/>
    </condition>

    <!-- ******************************  KL1x    ****************************** -->
    <condition id="MKL14Z4 CMSIS">
      <description>NXP Kinetis KL14 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL14Z32xxx4"/>
      <accept Dname="MKL14Z64xxx4"/>
    </condition>
    <condition id="MKL15Z4 CMSIS">
      <description>NXP Kinetis KL15 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL15Z128xxx4"/>
      <accept Dname="MKL15Z32xxx4"/>
      <accept Dname="MKL15Z64xxx4"/>
    </condition>
    <condition id="MKL16Z4 CMSIS">
      <description>NXP Kinetis KL16 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL16Z128xxx4"/>
      <accept Dname="MKL16Z32xxx4"/>
      <accept Dname="MKL16Z64xxx4"/>
      <accept Dname="MKL16Z256xxx4"/>
    </condition>

    <!-- ******************************  KL2x    ****************************** -->
    <condition id="MKL24Z4 CMSIS">
      <description>NXP Kinetis KL24 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL24Z32xxx4"/>
      <accept Dname="MKL24Z64xxx4"/>
    </condition>
    <condition id="MKL25Z4 CMSIS">
      <description>NXP Kinetis KL25 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL25Z128xxx4"/>
      <accept Dname="MKL25Z32xxx4"/>
      <accept Dname="MKL25Z64xxx4"/>
    </condition>
    <condition id="MKL26Z4 CMSIS">
      <description>NXP Kinetis KL26 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL26Z32xxx4"/>
      <accept Dname="MKL26Z64xxx4"/>
      </condition>

    <!-- ******************************  KL4x    ****************************** -->
    <condition id="MKL43Z4 CMSIS">
      <description>NXP Kinetis KL43 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL43Z64xxx4"/>
    </condition>
  </conditions>

  <components>
    <!-- ******************************  KL0x    ****************************** -->
    <!-- Startup MKL04Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL04Z4 CMSIS">
      <description>System Startup for NXP MKL04Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL04Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL04Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL05Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL05Z4 CMSIS">
      <description>System Startup for NXP MKL05Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL05Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL05Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL1x    ****************************** -->
    <!-- Startup MKL14Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL14Z4 CMSIS">
      <description>System Startup for NXP MKL14Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL14Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL14Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL15Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL15Z4 CMSIS">
      <description>System Startup for NXP MKL15Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL15Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL15Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL16Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL16Z4 CMSIS">
      <description>System Startup for NXP MKL16Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL16Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL16Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL2x    ****************************** -->
    <!-- Startup MKL24Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL24Z4 CMSIS">
      <description>System Startup for NXP MKL24Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL24Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL24Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL25Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="MKL25Z4 CMSIS">
      <description>System Startup for NXP MKL25Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL25Z4.s"   attr="config" version="2.5.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL25Z4.c"        attr="config" version="2.5.0"/>
        <file category="header"  name="Device/Source/system_MKL25Z4.h"        attr="config" version="2.5.0"/>
      </files>
    </component>
    <!-- Startup MKL26Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL26Z4 CMSIS">
      <description>System Startup for NXP MKL26Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL26Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL26Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL4x    ****************************** -->
    <!-- Startup MKL43Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MKL43Z4 CMSIS">
      <description>System Startup for NXP MKL43Z4 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKL43Z4.s"   attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL43Z4.c"        attr="config" version="1.1.0"/>
        <file category="header"  name="Device/Source/system_MKL43Z4.h"        attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- FRDM-KL25Z board support -->
    <bundle Cbundle="FRDM-KL25Z" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP FRDM-KL25Z board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="MKL25Z4 CMSIS">
      <description>LED driver for NXP FRDM-KL25Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KL25Z/Common/LED_FRDM-KL25Z.c"/>
        </files>
      </component>
    </bundle>
  </components>

